Revit 2027 API
Revision.RevisionNumber Property
 The Revision number of this revision.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string RevisionNumber { get; }
Public ReadOnly Property RevisionNumber As String
	Get
public:
property String^ RevisionNumber {
	String^ get ();
}
member RevisionNumber : string with get
Property Value
String
Exceptions
Exception | Condition
InvalidOperationException |  This operation is not valid for when the revision numbering is per sheet.
Remarks
 Note that this field is only available if the RevisionSettings are set to number revisions PerProject. When Revisions are numbered PerSheet, a given Revision may display a different RevisionNumber on each sheet. In this case, the revision number can be obtained by calling [!:Autodesk::Revit::DB::ViewSheet::GetRevisionNumberOnSheet()].
See Also
Reference
Revision Class
Autodesk.Revit.DB Namespace